Coding/Cpp/STL:Algorithm.html

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> inner_product</h2>
<div class="outline-text-2" id="text-5">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator2</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span> &gt;
<span style="color: #228b22;">T</span> <span style="color: #0000ff;">inner_product</span>( <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">first1</span>, <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">last1</span>,
                 <span style="color: #228b22;">InputIterator2</span> <span style="color: #a0522d;">first2</span>, <span style="color: #228b22;">T</span> <span style="color: #a0522d;">value</span> );

<span style="color: #a020f0;">template</span>&lt;
    <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator1</span>,
    <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator2</span>,
    <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span>,
    <span style="color: #a020f0;">class</span> <span style="color: #228b22;">BinaryOperation1</span>,
    <span style="color: #a020f0;">class</span> <span style="color: #228b22;">BinaryOperation2</span>
&gt; <span style="color: #228b22;">T</span> <span style="color: #0000ff;">inner_product</span>( <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">first1</span>, <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">last1</span>,
                   <span style="color: #228b22;">InputIterator2</span> <span style="color: #a0522d;">first2</span>, <span style="color: #228b22;">T</span> <span style="color: #a0522d;">value</span>,
                   <span style="color: #228b22;">BinaryOperation1</span> <span style="color: #a0522d;">op1</span>,
                   <span style="color: #228b22;">BinaryOperation2</span> <span style="color: #a0522d;">op2</span> );
</pre>

<ol>
<li>[first1, last1)与first2开始last1-first1个构成的区间对应的元素相乘后相加。<br/>
</li>
<li>1中的相乘改为op2，相加改为op1.<br/>
</li>
</ol>




<pre class="src src-c++"><span style="color: #228b22;">int</span> <span style="color: #a0522d;">ip1</span>[] = {1,2,3};
<span style="color: #228b22;">int</span> <span style="color: #a0522d;">ip2</span>[] = {2,3,4,5,6};
cout&lt;&lt;inner_product(ip1,ip1+3,ip2, 100)&lt;&lt;endl; <span style="color: #b22222;">// </span><span style="color: #b22222;">100+1*2+2*3+3*4=120</span>
cout&lt;&lt;inner_product(ip1,ip1+3,ip2, 100, <span style="color: #228b22;">minus</span>&lt;<span style="color: #228b22;">int</span>&gt;(), <span style="color: #228b22;">plus</span>&lt;<span style="color: #228b22;">int</span>&gt;())&lt;&lt;endl; <span style="color: #b22222;">// </span><span style="color: #b22222;">100-(1+2)-(2+3)-(3+4)=85</span>
</pre>

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> partial_sum</h2>
<div class="outline-text-2" id="text-6">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">OutputIterator</span> &gt;
<span style="color: #228b22;">OutputIterator</span> <span style="color: #0000ff;">partial_sum</span>( <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">OutputIterator</span> <span style="color: #a0522d;">d_first</span> );

<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">OutputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">BinaryOperation</span> &gt;
<span style="color: #228b22;">OutputIterator</span> <span style="color: #0000ff;">partial_sum</span>( <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">OutputIterator</span> <span style="color: #a0522d;">d_first</span>,
                            <span style="color: #228b22;">BinaryOperation</span> <span style="color: #a0522d;">op</span> );
</pre>

<p>
  所做的操作为：<br/>
</p>


<pre class="example">*(d_first)   = *first;
*(d_first+1) = *first + *(first+1);
*(d_first+2) = *first + *(first+1) + *(first+2);
*(d_first+3) = *first + *(first+1) + *(first+2) + *(first+3);
...
</pre>

<p>
  第2个版本中用op操作替换+.<br/>
</p>


<pre class="src src-c++"><span style="color: #228b22;">int</span> <span style="color: #a0522d;">ip2</span>[] = {2,3,4,5,6};
partial_sum(ip2, ip2+5, <span style="color: #228b22;">ostream_iterator</span>&lt;<span style="color: #228b22;">int</span>&gt;(cout, <span style="color: #8b2252;">" "</span>)); <span style="color: #b22222;">// </span><span style="color: #b22222;">2 5 9 14 20</span>
partial_sum(ip2, ip2+5, <span style="color: #228b22;">ostream_iterator</span>&lt;<span style="color: #228b22;">int</span>&gt;(cout, <span style="color: #8b2252;">" "</span>), <span style="color: #228b22;">minus</span>&lt;<span style="color: #228b22;">int</span>&gt;()); <span style="color: #b22222;">// </span><span style="color: #b22222;">2 -1 -5 -10 -16</span>
</pre>

</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> adjacent_difference</h2>
<div class="outline-text-2" id="text-7">

<p>  与partial_sum相似。只是操作相邻元素。<br/>
</p>


<pre class="example">*(d_first)   = *first;
*(d_first+1) = (*first+1) - *(first);
*(d_first+2) = (*first+2) - *(first+1);
*(d_first+3) = (*first+3) - *(first+2);
</pre>



<pre class="src src-c++"><span style="color: #228b22;">int</span> <span style="color: #a0522d;">ip2</span>[] = {2,3,4,5,6};
adjacent_difference(ip2, ip2+5, <span style="color: #228b22;">ostream_iterator</span>&lt;<span style="color: #228b22;">int</span>&gt;(cout, <span style="color: #8b2252;">" "</span>)); <span style="color: #b22222;">// </span><span style="color: #b22222;">2 1 1 1 1</span>
adjacent_difference(ip2, ip2+5, <span style="color: #228b22;">ostream_iterator</span>&lt;<span style="color: #228b22;">int</span>&gt;(cout, <span style="color: #8b2252;">" "</span>), <span style="color: #228b22;">plus</span>&lt;<span style="color: #228b22;">int</span>&gt;()); <span style="color: #b22222;">// </span><span style="color: #b22222;">2 5 7 9 11</span>
</pre>

</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> equal</h2>
<div class="outline-text-2" id="text-8">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator2</span> &gt;
<span style="color: #228b22;">bool</span> <span style="color: #0000ff;">equal</span>( <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">first1</span>, <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">last1</span>, 
            <span style="color: #228b22;">InputIterator2</span> <span style="color: #a0522d;">first2</span> );

<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator2</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">BinaryPredicate</span> &gt;
<span style="color: #228b22;">bool</span> <span style="color: #0000ff;">equal</span>( <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">first1</span>, <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">last1</span>, 
            <span style="color: #228b22;">InputIterator2</span> <span style="color: #a0522d;">first2</span>, <span style="color: #228b22;">BinaryPredicate</span> <span style="color: #a0522d;">p</span> );
</pre>

<p>
  [first1,last1)之间的元素是否与first2开始的同等个数的区间对应元素相同。如果first2开始的元素个数没有first1到last1之间的多则结果不确定。<br/>
  第2个版本可以自定义比较操作，默认是相等。<br/>
</p>


<pre class="src src-c++"><span style="color: #228b22;">int</span> <span style="color: #a0522d;">ip1</span>[] = {1,2,3};
<span style="color: #228b22;">int</span> <span style="color: #a0522d;">ip2</span>[] = {1,2,3,4,5,6};
cout&lt;&lt;equal(ip1,ip1+3,ip2)&lt;&lt;endl; <span style="color: #b22222;">// </span><span style="color: #b22222;">1</span>
cout&lt;&lt;equal(ip1,ip1+3,ip2+1)&lt;&lt;endl; <span style="color: #b22222;">// </span><span style="color: #b22222;">0</span>
cout&lt;&lt;equal(ip1,ip1+3,ip2+1, <span style="color: #228b22;">less</span>&lt;<span style="color: #228b22;">int</span>&gt;())&lt;&lt;endl; <span style="color: #b22222;">// </span><span style="color: #b22222;">1</span>
</pre>

</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> fill</h2>
<div class="outline-text-2" id="text-9">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span> &gt;
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">fill</span>( <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span>&amp; <span style="color: #a0522d;">value</span> );
</pre>

<p>
  用value填充区间[first,last).<br/>
</p></div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> fill_n</h2>
<div class="outline-text-2" id="text-10">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">OutputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Size</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span> &gt;
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">fill_n</span>( <span style="color: #228b22;">OutputIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">Size</span> <span style="color: #a0522d;">count</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span>&amp; <span style="color: #a0522d;">value</span> );        <span style="color: #b22222;">//</span><span style="color: #b22222;">before c++11</span>

<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">OutputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Size</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span> &gt;
<span style="color: #228b22;">OutputIterator</span> <span style="color: #0000ff;">fill_n</span>( <span style="color: #228b22;">OutputIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">Size</span> <span style="color: #a0522d;">count</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span>&amp; <span style="color: #a0522d;">value</span> ); <span style="color: #b22222;">//</span><span style="color: #b22222;">C++11</span>
</pre>

<p>
  填充指定位置开始的指定个数元素，C++11中返回值与advance(first,count);相同。<br/>
</p></div>

</div>
