Coding/Cpp/STL:Algorithm.org
* iter_swap
#+begin_src c++
template< class ForwardIterator1, class ForwardIterator2 >
void iter_swap( ForwardIterator1 a, ForwardIterator2 b );
#+end_src
  交换两个迭代器的内容。调用的是swap函数。
* swap
#+begin_src c++
template< class T >
void swap( T& a, T& b );

template< class T, size_t N >
void swap( T (&a)[N], T (&b)[N]);       //c++11
#+end_src
  swap可交换的对象包含了几乎所有的泛型对象：vector,list,queue...
  C++11的swap调用的是swap_range(a, a+N, b);
* swap_range
#+begin_src c++
template< class ForwardIterator1, class ForwardIterator2 >
ForwardIterator2 swap_ranges( ForwardIterator1 first1,
                              ForwardIterator1 last1, 
                              ForwardIterator2 first2 )
#+end_src
  交换[first1,last1)与first2开始的区间。
  内部调用的是iter_swap。
* lexicographical_compare
#+begin_src c++
template< class InputIterator1, class InputIterator2 >
bool lexicographical_compare( InputIterator1 first1, InputIterator1 last1,
                              InputIterator2 first2, InputIterator2 last2 );

template< class InputIterator1, class InputIterator2, class Compare >
bool lexicographical_compare( InputIterator1 first1, InputIterator1 last1,
                              InputIterator2 first2, InputIterator2 last2,
                              Compare comp );
#+end_src
  以词典序排序。
  先比较 min((last1-first1),(last2-first2)) 个，如果比较出来则返回否则第1个区间短则返回真否则返回假。
* mismatch
#+begin_src c++
template< class InputIterator1, class InputIterator2 >
std::pair<InputIterator1,InputIterator2>
    mismatch( InputIterator1 first1,
              InputIterator1 last1,
              InputIterator2 first2 );

template< class InputIterator1, class InputIterator2, class BinaryPredicate >
std::pair<InputIterator1,InputIterator2>
    mismatch( InputIterator1 first1,
              InputIterator1 last1,
              InputIterator2 first2,
              BinaryPredicate p );
#+end_src
  返回第一次不匹配的第1个区间迭代器和第2个区间迭代器构成的pair.
